GopalSaraf/Practicals/PSDL/include/proc/pic18f15q40.inc
#define ODCB6                            BANKMASK(ODCONB), 6, b
#define ODCB7                            BANKMASK(ODCONB), 7, b
#define ODCC0                            BANKMASK(ODCONC), 0, b
#define ODCC1                            BANKMASK(ODCONC), 1, b
#define ODCC2                            BANKMASK(ODCONC), 2, b
#define ODCC3                            BANKMASK(ODCONC), 3, b
#define ODCC4                            BANKMASK(ODCONC), 4, b
#define ODCC5                            BANKMASK(ODCONC), 5, b
#define ODCC6                            BANKMASK(ODCONC), 6, b
#define ODCC7                            BANKMASK(ODCONC), 7, b
#define OE0                              BANKMASK(DAC1CON), 4, b
#define OE1                              BANKMASK(DAC1CON), 5, b
#define OPOL                             BANKMASK(MD1CON0), 4, b
#define ORDY                             BANKMASK(OSCCON3), 4, b
#define ORS                              BANKMASK(ACTCON), 1, b
#define OSFIE                            BANKMASK(PIE0), 2, a
#define OSFIF                            BANKMASK(PIR0), 2, a
#define OSFIP                            BANKMASK(IPR0), 2, b
#define OUT0                             BANKMASK(CRCOUTL), 0, b
#define OUT1                             BANKMASK(CRCOUTL), 1, b
#define OUT10                            BANKMASK(CRCOUTH), 2, b
#define OUT11                            BANKMASK(CRCOUTH), 3, b
#define OUT12                            BANKMASK(CRCOUTH), 4, b
#define OUT13                            BANKMASK(CRCOUTH), 5, b
#define OUT14                            BANKMASK(CRCOUTH), 6, b
#define OUT15                            BANKMASK(CRCOUTH), 7, b
#define OUT16                            BANKMASK(CRCOUTU), 0, b
#define OUT17                            BANKMASK(CRCOUTU), 1, b
#define OUT18                            BANKMASK(CRCOUTU), 2, b
#define OUT19                            BANKMASK(CRCOUTU), 3, b
#define OUT2                             BANKMASK(CRCOUTL), 2, b
#define OUT20                            BANKMASK(CRCOUTU), 4, b
#define OUT21                            BANKMASK(CRCOUTU), 5, b
#define OUT22                            BANKMASK(CRCOUTU), 6, b
#define OUT23                            BANKMASK(CRCOUTU), 7, b
#define OUT24                            BANKMASK(CRCOUTT), 0, b
#define OUT25                            BANKMASK(CRCOUTT), 1, b
#define OUT26                            BANKMASK(CRCOUTT), 2, b
#define OUT27                            BANKMASK(CRCOUTT), 3, b
#define OUT28                            BANKMASK(CRCOUTT), 4, b
#define OUT29                            BANKMASK(CRCOUTT), 5, b
#define OUT3                             BANKMASK(CRCOUTL), 3, b
#define OUT30                            BANKMASK(CRCOUTT), 6, b
#define OUT31                            BANKMASK(CRCOUTT), 7, b
#define OUT4                             BANKMASK(CRCOUTL), 4, b
#define OUT5                             BANKMASK(CRCOUTL), 5, b
#define OUT6                             BANKMASK(CRCOUTL), 6, b
#define OUT7                             BANKMASK(CRCOUTL), 7, b
#define OUT8                             BANKMASK(CRCOUTH), 0, b
#define OUT9                             BANKMASK(CRCOUTH), 1, b
#define OVRA                             BANKMASK(CWG1STR), 4, b
#define OVRB                             BANKMASK(CWG1STR), 5, b
#define OVRC                             BANKMASK(CWG1STR), 6, b
#define OVRD                             BANKMASK(CWG1STR), 7, b
#define P1H                              BANKMASK(U1P1H), 0, b
#define P2H                              BANKMASK(U1P2H), 0, b
#define P3H                              BANKMASK(U1P3H), 0, b
#define PC1IE                            BANKMASK(I2C1PIE), 2, b
#define PC1IF                            BANKMASK(I2C1PIR), 2, b
#define PCIE                             BANKMASK(I2C1PIE), 2, b
#define PCIF                             BANKMASK(I2C1PIR), 2, b
#define PFM                              BANKMASK(NCO1CON), 0, b
#define PLEN0                            BANKMASK(CRCCON1), 0, b
#define PLEN1                            BANKMASK(CRCCON1), 1, b
#define PLEN2                            BANKMASK(CRCCON1), 2, b
#define PLEN3                            BANKMASK(CRCCON1), 3, b
#define PLEN4                            BANKMASK(CRCCON1), 4, b
#define PLLEN                            BANKMASK(OSCEN), 0, b
#define PLLR                             BANKMASK(OSCSTAT), 0, b
#define PMSYS0                           BANKMASK(VREGCON), 4, b
#define PMSYS1                           BANKMASK(VREGCON), 5, b
#define POLA                             BANKMASK(CWG1CON1), 0, b
#define POLB                             BANKMASK(CWG1CON1), 1, b
#define POLC                             BANKMASK(CWG1CON1), 2, b
#define POLD                             BANKMASK(CWG1CON1), 3, b
#define POR                              BANKMASK(PCON0), 1, a
#define PPOL                             BANKMASK(ADCON1), 7, b
#define PPSLOCKED                        BANKMASK(PPSLOCK), 0, b
#define PRE0                             BANKMASK(ADPREL), 0, b
#define PRE1                             BANKMASK(ADPREL), 1, b
#define PRE10                            BANKMASK(ADPREH), 2, b
#define PRE11                            BANKMASK(ADPREH), 3, b
#define PRE12                            BANKMASK(ADPREH), 4, b
#define PRE2                             BANKMASK(ADPREL), 2, b
#define PRE3                             BANKMASK(ADPREL), 3, b
#define PRE4                             BANKMASK(ADPREL), 4, b
#define PRE5                             BANKMASK(ADPREL), 5, b
#define PRE6                             BANKMASK(ADPREL), 6, b
#define PRE7                             BANKMASK(ADPREL), 7, b
#define PRE8                             BANKMASK(ADPREH), 0, b
#define PRE9                             BANKMASK(ADPREH), 1, b
#define PREF0                            BANKMASK(ADREF), 0, b
#define PREF1                            BANKMASK(ADREF), 1, b
#define PREF2                            BANKMASK(ADREF), 2, b
#define PREF3                            BANKMASK(ADREF), 3, b
#define PREV0                            BANKMASK(ADPREVL), 0, b
#define PREV1                            BANKMASK(ADPREVL), 1, b
#define PREV10                           BANKMASK(ADPREVH), 2, b
#define PREV11                           BANKMASK(ADPREVH), 3, b
#define PREV12                           BANKMASK(ADPREVH), 4, b
#define PREV13                           BANKMASK(ADPREVH), 5, b
#define PREV14                           BANKMASK(ADPREVH), 6, b
#define PREV15                           BANKMASK(ADPREVH), 7, b
#define PREV2                            BANKMASK(ADPREVL), 2, b
#define PREV3                            BANKMASK(ADPREVL), 3, b
#define PREV4                            BANKMASK(ADPREVL), 4, b
#define PREV5                            BANKMASK(ADPREVL), 5, b
#define PREV6                            BANKMASK(ADPREVL), 6, b
#define PREV7                            BANKMASK(ADPREVL), 7, b
#define PREV8                            BANKMASK(ADPREVH), 0, b
#define PREV9                            BANKMASK(ADPREVH), 1, b
#define PRLOCKED                         BANKMASK(PRLOCK), 0, b
#define PS0                              BANKMASK(WDTCON0), 1, b
#define PS1                              BANKMASK(WDTCON0), 2, b
#define PS2                              BANKMASK(WDTCON0), 3, b
#define PS3                              BANKMASK(WDTCON0), 4, b
#define PS4                              BANKMASK(WDTCON0), 5, b
#define PSCNT0                           BANKMASK(WDTPSL), 0, b
#define PSCNT1                           BANKMASK(WDTPSL), 1, b
#define PSCNT10                          BANKMASK(WDTPSH), 2, b
#define PSCNT11                          BANKMASK(WDTPSH), 3, b
#define PSCNT12                          BANKMASK(WDTPSH), 4, b
#define PSCNT13                          BANKMASK(WDTPSH), 5, b
#define PSCNT14                          BANKMASK(WDTPSH), 6, b
#define PSCNT15                          BANKMASK(WDTPSH), 7, b
#define PSCNT16                          BANKMASK(WDTTMR), 0, b
#define PSCNT17                          BANKMASK(WDTTMR), 1, b
#define PSCNT2                           BANKMASK(WDTPSL), 2, b
#define PSCNT3                           BANKMASK(WDTPSL), 3, b
#define PSCNT4                           BANKMASK(WDTPSL), 4, b
#define PSCNT5                           BANKMASK(WDTPSL), 5, b
#define PSCNT6                           BANKMASK(WDTPSL), 6, b
#define PSCNT7                           BANKMASK(WDTPSL), 7, b
#define PSCNT8                           BANKMASK(WDTPSH), 0, b
#define PSCNT9                           BANKMASK(WDTPSH), 1, b
#define PSIS                             BANKMASK(ADCON2), 7, b
#define PWM1ERSPPS0                      BANKMASK(PWM1ERSPPS), 0, b
#define PWM1ERSPPS1                      BANKMASK(PWM1ERSPPS), 1, b
#define PWM1ERSPPS2                      BANKMASK(PWM1ERSPPS), 2, b
#define PWM1ERSPPS3                      BANKMASK(PWM1ERSPPS), 3, b
#define PWM1ERSPPS4                      BANKMASK(PWM1ERSPPS), 4, b
#define PWM1ERSPPS5                      BANKMASK(PWM1ERSPPS), 5, b
#define PWM1IE                           BANKMASK(PIE4), 7, a
#define PWM1IF                           BANKMASK(PIR4), 7, a
#define PWM1IP                           BANKMASK(IPR4), 7, b
#define PWM1MD                           BANKMASK(PMD3), 0, b
#define PWM1PIE                          BANKMASK(PIE4), 6, a
#define PWM1PIF                          BANKMASK(PIR4), 6, a
#define PWM1PIP                          BANKMASK(IPR4), 6, b
#define PWM2ERSPPS0                      BANKMASK(PWM2ERSPPS), 0, b
#define PWM2ERSPPS1                      BANKMASK(PWM2ERSPPS), 1, b
#define PWM2ERSPPS2                      BANKMASK(PWM2ERSPPS), 2, b
#define PWM2ERSPPS3                      BANKMASK(PWM2ERSPPS), 3, b
#define PWM2ERSPPS4                      BANKMASK(PWM2ERSPPS), 4, b
#define PWM2ERSPPS5                      BANKMASK(PWM2ERSPPS), 5, b
#define PWM2IE                           BANKMASK(PIE5), 7, a
#define PWM2IF                           BANKMASK(PIR5), 7, a
#define PWM2IP                           BANKMASK(IPR5), 7, b
#define PWM2MD                           BANKMASK(PMD3), 1, b
#define PWM2PIE                          BANKMASK(PIE5), 6, a
#define PWM2PIF                          BANKMASK(PIR5), 6, a
#define PWM2PIP                          BANKMASK(IPR5), 6, b
#define PWM3ERSPPS0                      BANKMASK(PWM3ERSPPS), 0, b
#define PWM3ERSPPS1                      BANKMASK(PWM3ERSPPS), 1, b
#define PWM3ERSPPS2                      BANKMASK(PWM3ERSPPS), 2, b
#define PWM3ERSPPS3                      BANKMASK(PWM3ERSPPS), 3, b
#define PWM3ERSPPS4                      BANKMASK(PWM3ERSPPS), 4, b
#define PWM3ERSPPS5                      BANKMASK(PWM3ERSPPS), 5, b
#define PWM3IE                           BANKMASK(PIE7), 7, a
#define PWM3IF                           BANKMASK(PIR7), 7, a
#define PWM3IP                           BANKMASK(IPR7), 7, b
#define PWM3MD                           BANKMASK(PMD3), 2, b
#define PWM3PIE                          BANKMASK(PIE7), 6, a
#define PWM3PIF                          BANKMASK(PIR7), 6, a
#define PWM3PIP                          BANKMASK(IPR7), 6, b
#define PWMIN0PPS0                       BANKMASK(PWMIN0PPS), 0, b
#define PWMIN0PPS1                       BANKMASK(PWMIN0PPS), 1, b
#define PWMIN0PPS2                       BANKMASK(PWMIN0PPS), 2, b
#define PWMIN0PPS3                       BANKMASK(PWMIN0PPS), 3, b
#define PWMIN0PPS4                       BANKMASK(PWMIN0PPS), 4, b
#define PWMIN0PPS5                       BANKMASK(PWMIN0PPS), 5, b
#define PWMIN1PPS0                       BANKMASK(PWMIN1PPS), 0, b
#define PWMIN1PPS1                       BANKMASK(PWMIN1PPS), 1, b
#define PWMIN1PPS2                       BANKMASK(PWMIN1PPS), 2, b
#define PWMIN1PPS3                       BANKMASK(PWMIN1PPS), 3, b
#define PWMIN1PPS4                       BANKMASK(PWMIN1PPS), 4, b
#define PWMIN1PPS5                       BANKMASK(PWMIN1PPS), 5, b
#define PWS0                             BANKMASK(NCO1CLK), 5, b
#define PWS1                             BANKMASK(NCO1CLK), 6, b
#define PWS2                             BANKMASK(NCO1CLK), 7, b
#define RA0                              BANKMASK(PORTA), 0, a
#define RA0PPS0                          BANKMASK(RA0PPS), 0, b
#define RA0PPS1                          BANKMASK(RA0PPS), 1, b
#define RA0PPS2                          BANKMASK(RA0PPS), 2, b
#define RA0PPS3                          BANKMASK(RA0PPS), 3, b
#define RA0PPS4                          BANKMASK(RA0PPS), 4, b
#define RA0PPS5                          BANKMASK(RA0PPS), 5, b
#define RA1                              BANKMASK(PORTA), 1, a
#define RA1PPS0                          BANKMASK(RA1PPS), 0, b
#define RA1PPS1                          BANKMASK(RA1PPS), 1, b
#define RA1PPS2                          BANKMASK(RA1PPS), 2, b
#define RA1PPS3                          BANKMASK(RA1PPS), 3, b
#define RA1PPS4                          BANKMASK(RA1PPS), 4, b
#define RA1PPS5                          BANKMASK(RA1PPS), 5, b
#define RA2                              BANKMASK(PORTA), 2, a
#define RA2PPS0                          BANKMASK(RA2PPS), 0, b
#define RA2PPS1                          BANKMASK(RA2PPS), 1, b
#define RA2PPS2                          BANKMASK(RA2PPS), 2, b
#define RA2PPS3                          BANKMASK(RA2PPS), 3, b
#define RA2PPS4                          BANKMASK(RA2PPS), 4, b
#define RA2PPS5                          BANKMASK(RA2PPS), 5, b
#define RA3                              BANKMASK(PORTA), 3, a
#define RA4                              BANKMASK(PORTA), 4, a
#define RA4PPS0                          BANKMASK(RA4PPS), 0, b
#define RA4PPS1                          BANKMASK(RA4PPS), 1, b
#define RA4PPS2                          BANKMASK(RA4PPS), 2, b
#define RA4PPS3                          BANKMASK(RA4PPS), 3, b
#define RA4PPS4                          BANKMASK(RA4PPS), 4, b
#define RA4PPS5                          BANKMASK(RA4PPS), 5, b
#define RA5                              BANKMASK(PORTA), 5, a
#define RA5PPS0                          BANKMASK(RA5PPS), 0, b
#define RA5PPS1                          BANKMASK(RA5PPS), 1, b
#define RA5PPS2                          BANKMASK(RA5PPS), 2, b
#define RA5PPS3                          BANKMASK(RA5PPS), 3, b
#define RA5PPS4                          BANKMASK(RA5PPS), 4, b
#define RA5PPS5                          BANKMASK(RA5PPS), 5, b
#define RB4                              BANKMASK(PORTB), 4, a
#define RB4PPS0                          BANKMASK(RB4PPS), 0, b
#define RB4PPS1                          BANKMASK(RB4PPS), 1, b
#define RB4PPS2                          BANKMASK(RB4PPS), 2, b
#define RB4PPS3                          BANKMASK(RB4PPS), 3, b
#define RB4PPS4                          BANKMASK(RB4PPS), 4, b
#define RB4PPS5                          BANKMASK(RB4PPS), 5, b
#define RB5                              BANKMASK(PORTB), 5, a
#define RB5PPS0                          BANKMASK(RB5PPS), 0, b
#define RB5PPS1                          BANKMASK(RB5PPS), 1, b
#define RB5PPS2                          BANKMASK(RB5PPS), 2, b
#define RB5PPS3                          BANKMASK(RB5PPS), 3, b
#define RB5PPS4                          BANKMASK(RB5PPS), 4, b
#define RB5PPS5                          BANKMASK(RB5PPS), 5, b
#define RB6                              BANKMASK(PORTB), 6, a
#define RB6PPS0                          BANKMASK(RB6PPS), 0, b
#define RB6PPS1                          BANKMASK(RB6PPS), 1, b
#define RB6PPS2                          BANKMASK(RB6PPS), 2, b
#define RB6PPS3                          BANKMASK(RB6PPS), 3, b
#define RB6PPS4                          BANKMASK(RB6PPS), 4, b
#define RB6PPS5                          BANKMASK(RB6PPS), 5, b
#define RB7                              BANKMASK(PORTB), 7, a
#define RB7PPS0                          BANKMASK(RB7PPS), 0, b
#define RB7PPS1                          BANKMASK(RB7PPS), 1, b
#define RB7PPS2                          BANKMASK(RB7PPS), 2, b
#define RB7PPS3                          BANKMASK(RB7PPS), 3, b
#define RB7PPS4                          BANKMASK(RB7PPS), 4, b
#define RB7PPS5                          BANKMASK(RB7PPS), 5, b
#define RC0                              BANKMASK(PORTC), 0, a
#define RC0PPS0                          BANKMASK(RC0PPS), 0, b
#define RC0PPS1                          BANKMASK(RC0PPS), 1, b
#define RC0PPS2                          BANKMASK(RC0PPS), 2, b
#define RC0PPS3                          BANKMASK(RC0PPS), 3, b
#define RC0PPS4                          BANKMASK(RC0PPS), 4, b
#define RC0PPS5                          BANKMASK(RC0PPS), 5, b
#define RC1                              BANKMASK(PORTC), 1, a
#define RC1PPS0                          BANKMASK(RC1PPS), 0, b
#define RC1PPS1                          BANKMASK(RC1PPS), 1, b
#define RC1PPS2                          BANKMASK(RC1PPS), 2, b
#define RC1PPS3                          BANKMASK(RC1PPS), 3, b
#define RC1PPS4                          BANKMASK(RC1PPS), 4, b
#define RC1PPS5                          BANKMASK(RC1PPS), 5, b
#define RC2                              BANKMASK(PORTC), 2, a
#define RC2PPS0                          BANKMASK(RC2PPS), 0, b
#define RC2PPS1                          BANKMASK(RC2PPS), 1, b
#define RC2PPS2                          BANKMASK(RC2PPS), 2, b
#define RC2PPS3                          BANKMASK(RC2PPS), 3, b
#define RC2PPS4                          BANKMASK(RC2PPS), 4, b
#define RC2PPS5                          BANKMASK(RC2PPS), 5, b
#define RC3                              BANKMASK(PORTC), 3, a
#define RC3PPS0                          BANKMASK(RC3PPS), 0, b
#define RC3PPS1                          BANKMASK(RC3PPS), 1, b
#define RC3PPS2                          BANKMASK(RC3PPS), 2, b
#define RC3PPS3                          BANKMASK(RC3PPS), 3, b
#define RC3PPS4                          BANKMASK(RC3PPS), 4, b
#define RC3PPS5                          BANKMASK(RC3PPS), 5, b
#define RC4                              BANKMASK(PORTC), 4, a
#define RC4PPS0                          BANKMASK(RC4PPS), 0, b
#define RC4PPS1                          BANKMASK(RC4PPS), 1, b
#define RC4PPS2                          BANKMASK(RC4PPS), 2, b
#define RC4PPS3                          BANKMASK(RC4PPS), 3, b
#define RC4PPS4                          BANKMASK(RC4PPS), 4, b
#define RC4PPS5                          BANKMASK(RC4PPS), 5, b
#define RC5                              BANKMASK(PORTC), 5, a
#define RC5PPS0                          BANKMASK(RC5PPS), 0, b
#define RC5PPS1                          BANKMASK(RC5PPS), 1, b
#define RC5PPS2                          BANKMASK(RC5PPS), 2, b
#define RC5PPS3                          BANKMASK(RC5PPS), 3, b
#define RC5PPS4                          BANKMASK(RC5PPS), 4, b
#define RC5PPS5                          BANKMASK(RC5PPS), 5, b
#define RC6                              BANKMASK(PORTC), 6, a
#define RC6PPS0                          BANKMASK(RC6PPS), 0, b
#define RC6PPS1                          BANKMASK(RC6PPS), 1, b
#define RC6PPS2                          BANKMASK(RC6PPS), 2, b
#define RC6PPS3                          BANKMASK(RC6PPS), 3, b
#define RC6PPS4                          BANKMASK(RC6PPS), 4, b
#define RC6PPS5                          BANKMASK(RC6PPS), 5, b
#define RC7                              BANKMASK(PORTC), 7, a
#define RC7PPS0                          BANKMASK(RC7PPS), 0, b
#define RC7PPS1                          BANKMASK(RC7PPS), 1, b
#define RC7PPS2                          BANKMASK(RC7PPS), 2, b
#define RC7PPS3                          BANKMASK(RC7PPS), 3, b
#define RC7PPS4                          BANKMASK(RC7PPS), 4, b
#define RC7PPS5                          BANKMASK(RC7PPS), 5, b
#define RD161                            BANKMASK(T1CON), 1, b
#define RD163                            BANKMASK(T3CON), 1, b
#define READ                             BANKMASK(I2C1STAT0), 4, b
#define REN                              BANKMASK(CWG1AS0), 6, b
#define REPEAT                           BANKMASK(SMT1CON1), 6, b
#define RES0                             BANKMASK(ADRESL), 0, b
#define RES1                             BANKMASK(ADRESL), 1, b
#define RES10                            BANKMASK(ADRESH), 2, b
#define RES11                            BANKMASK(ADRESH), 3, b
#define RES12                            BANKMASK(ADRESH), 4, b
#define RES13                            BANKMASK(ADRESH), 5, b
#define RES14                            BANKMASK(ADRESH), 6, b
#define RES15                            BANKMASK(ADRESH), 7, b
#define RES2                             BANKMASK(ADRESL), 2, b
#define RES3                             BANKMASK(ADRESL), 3, b
#define RES4                             BANKMASK(ADRESL), 4, b
#define RES5                             BANKMASK(ADRESL), 5, b
#define RES6                             BANKMASK(ADRESL), 6, b
#define RES7                             BANKMASK(ADRESL), 7, b
#define RES8                             BANKMASK(ADRESH), 0, b
#define RES9                             BANKMASK(ADRESH), 1, b
#define RI                               BANKMASK(PCON0), 2, a
#define RMCLR                            BANKMASK(PCON0), 3, a
#define ROI                              BANKMASK(CPUDOZE), 5, a
#define RPT0                             BANKMASK(ADRPT), 0, b
#define RPT1                             BANKMASK(ADRPT), 1, b
#define RPT2                             BANKMASK(ADRPT), 2, b
#define RPT3                             BANKMASK(ADRPT), 3, b
#define RPT4                             BANKMASK(ADRPT), 4, b
#define RPT5                             BANKMASK(ADRPT), 5, b
#define RPT6                             BANKMASK(ADRPT), 6, b
#define RPT7                             BANKMASK(ADRPT), 7, b
#define RSC1IE                           BANKMASK(I2C1PIE), 1, b
#define RSC1IF                           BANKMASK(I2C1PIR), 1, b
#define RSCIE                            BANKMASK(I2C1PIE), 1, b
#define RSCIF                            BANKMASK(I2C1PIR), 1, b
#define RSEN                             BANKMASK(I2C1CON0), 6, b
#define RST                              BANKMASK(SMT1STAT), 5, b
#define RWDT                             BANKMASK(PCON0), 4, a
#define RXO                              BANKMASK(I2C1CON1), 2, b
#define SBOREN                           BANKMASK(BORCON), 7, b
#define SC1IE                            BANKMASK(I2C1PIE), 0, b
#define SC1IF                            BANKMASK(I2C1PIR), 0, b
#define SCANEN                           BANKMASK(SCANCON0), 7, b
#define SCANHADR0                        BANKMASK(SCANHADRL), 0, b
#define SCANHADR1                        BANKMASK(SCANHADRL), 1, b
#define SCANHADR10                       BANKMASK(SCANHADRH), 2, b
#define SCANHADR11                       BANKMASK(SCANHADRH), 3, b
#define SCANHADR12                       BANKMASK(SCANHADRH), 4, b
#define SCANHADR13                       BANKMASK(SCANHADRH), 5, b
#define SCANHADR14                       BANKMASK(SCANHADRH), 6, b
#define SCANHADR15                       BANKMASK(SCANHADRH), 7, b
#define SCANHADR16                       BANKMASK(SCANHADRU), 0, b
#define SCANHADR17                       BANKMASK(SCANHADRU), 1, b
#define SCANHADR18                       BANKMASK(SCANHADRU), 2, b
#define SCANHADR19                       BANKMASK(SCANHADRU), 3, b
#define SCANHADR2                        BANKMASK(SCANHADRL), 2, b
#define SCANHADR20                       BANKMASK(SCANHADRU), 4, b
#define SCANHADR21                       BANKMASK(SCANHADRU), 5, b
#define SCANHADR3                        BANKMASK(SCANHADRL), 3, b
#define SCANHADR4                        BANKMASK(SCANHADRL), 4, b
#define SCANHADR5                        BANKMASK(SCANHADRL), 5, b
